tutorials/floatRigidBody/floatRigidBody_moorDyn/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    stationaryWalls
    {
      type           fixedNormalSlip;
      value          (0 0 0);
      n              (0 1 0);
    }

    ground
    {
      type             fixedNormalSlip;
      value            (0 0 0);
      n                (0 0 1);
    }
    
    atmosphere
    {
        type            fixedNormalSlip;
        value           (0 0 0);
	n               (0 0 1);
    }
        floatingObject
    {
        type            calculated;
        value           uniform (0 0 0);
	}
}


// ************************************************************************* //
